performance-tests/load-test.yml
config:
  target: 'https://staging.automed.com'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 300
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load phase
    - duration: 600
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load phase
    - duration: 300
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    
    # Cool-down phase
    - duration: 120
      arrivalRate: 100
      rampTo: 5
      name: "Cool-down"

  processor: "./load-test-processor.js"
  
  # Performance thresholds
  ensure:
    - http.response_time.p95: 2000  # 95th percentile response time < 2s
    - http.response_time.p99: 5000  # 99th percentile response time < 5s
    - http.codes.200: 95            # 95% success rate
    - http.codes.500: 1             # Less than 1% server errors

  # Metrics collection
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    
scenarios:
  # Authentication flow
  - name: "User Authentication"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $randomEmail() }}"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

  # Patient management operations
  - name: "Patient Operations"
    weight: 30
    flow:
      - function: "setAuthHeader"
      - get:
          url: "/api/patients"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/patients/{{ $randomPatientId() }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - post:
          url: "/api/patients/{{ $randomPatientId() }}/vitals"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            heartRate: "{{ $randomInt(60, 100) }}"
            bloodPressure: "{{ $randomInt(110, 140) }}/{{ $randomInt(70, 90) }}"
            temperature: "{{ $randomFloat(36.0, 37.5) }}"
            timestamp: "{{ $now() }}"
          expect:
            - statusCode: 201

  # Hospital operations
  - name: "Hospital Operations"
    weight: 15
    flow:
      - function: "setAuthHeader"
      - get:
          url: "/api/hospitals"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/hospitals/{{ $randomHospitalId() }}/capacity"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # AI Assistant interactions
  - name: "AI Assistant"
    weight: 10
    flow:
      - function: "setAuthHeader"
      - post:
          url: "/api/ai/chat"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            message: "{{ $randomMedicalQuery() }}"
            sessionId: "{{ $uuid() }}"
          expect:
            - statusCode: 200
      
      - post:
          url: "/api/ai/diagnosis"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            symptoms: ["{{ $randomSymptom() }}", "{{ $randomSymptom() }}"]
            patientId: "{{ $randomPatientId() }}"
          expect:
            - statusCode: 200

  # Consultation operations
  - name: "Consultation Operations"
    weight: 15
    flow:
      - function: "setAuthHeader"
      - get:
          url: "/api/consultations"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - post:
          url: "/api/consultations"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            patientId: "{{ $randomPatientId() }}"
            doctorId: "{{ $randomDoctorId() }}"
            type: "video"
            scheduledAt: "{{ $futureTimestamp() }}"
          expect:
            - statusCode: 201

  # Analytics and reporting
  - name: "Analytics Operations"
    weight: 10
    flow:
      - function: "setAuthHeader"
      - get:
          url: "/api/analytics/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/analytics/predictive/risk-assessment"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/analytics/real-time/vitals"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

# Stress testing scenarios
stress_test:
  target: 'https://staging.automed.com'
  phases:
    # Gradual ramp-up to breaking point
    - duration: 300
      arrivalRate: 1
      rampTo: 200
      name: "Stress ramp-up"
    
    # Maintain high load
    - duration: 600
      arrivalRate: 200
      name: "Stress sustained"
    
    # Spike test
    - duration: 60
      arrivalRate: 500
      name: "Spike test"

# Endurance testing
endurance_test:
  target: 'https://staging.automed.com'
  phases:
    # Long-running test at moderate load
    - duration: 3600  # 1 hour
      arrivalRate: 25
      name: "Endurance test"

# Volume testing
volume_test:
  target: 'https://staging.automed.com'
  phases:
    # Test with large data volumes
    - duration: 1800  # 30 minutes
      arrivalRate: 10
      name: "Volume test"
  
  scenarios:
    - name: "Large Data Operations"
      flow:
        - function: "setAuthHeader"
        - post:
            url: "/api/patients/bulk-import"
            headers:
              Authorization: "Bearer {{ authToken }}"
            json:
              patients: "{{ $generateLargePatientDataset() }}"
          expect:
            - statusCode: 202
        
        - get:
            url: "/api/analytics/reports/comprehensive"
            headers:
              Authorization: "Bearer {{ authToken }}"
            qs:
              startDate: "2023-01-01"
              endDate: "2024-12-31"
              includeDetails: true
          expect:
            - statusCode: 200